[
    {
        "records": [
            {
                "id": 1,
                "name": "Apple Yoghurt Crunch",
                "description": "",
                "instructions": "Wash apple and chop into small pieces. Spoon Yoghurt into 6 small bowls. Fold in apple, cinnamon, slivers and almonds. Enjoy",
                "serving": 6,
                "prep_time": "00:05:00",
                "category": "bf"
            },
            {
                "id": 2,
                "name": "Apple-Glazed Chicken With Spinach",
                "description": "",
                "instructions": "For glaze, in a small microwave-safe bowl combine apple jelly, soy sauce, thyme, lemon peel, and ginger. Microwave, uncovered, on 100% power (high) for 60 to 90seconds or just until jelly is melted, stirring once. Reserve 2 tablespoons of glaze. Season chicken with salt and pepper. Place chicken on the unheated rack of a broiler pan. Broil 4 to 5 inches from the heat for 12 to 15 minutes or until chicken is tender and no longer pink, turning once halfway through the broiling time and brushing with the remaining glaze during the last 5 minutes of broiling. Discard remainder of glazed used as a brush-on. Meanwhile, coat an unheated large nonstick saucepan with nonstick cooking spray. Preheat over medium heat. Add apple, onion, and garlic to hot saucepan; cook and stir for 3 minutes. Stir in the reserved 2 tablespoons glaze; bring to boiling. Add spinach; toss just until wilted. To serve, slice each chicken breast half crosswise into 6-8 pieces. Divide spinach mixture between 2 dinner plates. Top with sliced chicken.",
                "serving": 2,
                "prep_time": "00:30:00",
                "category": "lunch"
            },
            {
                "id": 3,
                "name": "Roasted Tomatoes",
                "description": "",
                "instructions": "Heat toaster oven to 450 degrees Fahrenheit(233 degrees celcius). Lightly coat small oven-safe pan with cooking spray; then place tomatoes which have been cut in half on it. Spread margarine on each half of the tomatoes. Sprinkle breadcrumbs evenly over each half of tomato. Bake in hot oven for 8-10 minutes. Enjoy",
                "serving": 4,
                "prep_time": "00:15:00",
                "category": "supper"
            },
            {
                "id": 4,
                "name": "Banana Yoghurt Smoothie",
                "description": "",
                "instructions": "Peel one ripe banana and cut it into small cylindrical shapes. Add the banana cuts into a blender together with walnuts and vanilla yoghurt. Pulse slowly until well mashed and smooth.",
                "serving": 1,
                "prep_time": "00:05:00",
                "category": "snack"
            }
        ],
        "model": "recipe.Recipe",
        "unique_fields": [
            "id"
        ]

    }
]

